{
    "posts": [
        {
            "title": "Website Created",
            "date": "01.19.2024",
            "content": "I made this website to chronicle what I am learning about full stack web development. To make any of this happen, I first had to learn the basics of HTML and CSS. Then, I spent some time working on the simple javascript code for my Local Pastebin project. I made myself a little logo, and now I am brainstorming ideas for my next projects."
        },
	{
	    "title": "A Month?",
            "date": "02.27.2024",
            "content": "I have spent the better part of the last month relearning CSS and HTML. I started to do some work on JavaScript and quickly realized I needed to go back to the basics. I understand JavaScript OK, but full stack web dev is the goal, so that is what I am focusing on. Still working on that, but my CSS is moving along quickly. I'll work on styling the webpage and maybe focus on some more small projects."
	},
	{
	   "title": "Big Life Changes",
	   "date": "07.17.2024",
	   "content": "I quit my job, tried something new and it unfortunately didn't work out. But... three months ago, I got my GED. And then on July 1st I started college at WGU and transferred in 35% of a BS. I'm aiming to finish as fast as possible. Oh! I also rewrote a discord bot I made (MovieNightBot) to use SQLite which was a fun practical learning exercise for an SQL class I was taking."
	},
	{
	   "title": "Belt Tension Calculator",
	   "date": "07.30.2024",
	   "content": "I made a little belt tension calculator and put it up on Github pages. The reason its on github pages is I have made it for a friends business, and the page its hosted on is static elements. I ended up putting it in an iframe and loading it on the page. Heres the link, I am quite proud of it! <a href=\"https://lraithel15133.github.io/beltcalculator/\">https://lraithel15133.github.io/beltcalculator/</a> and <a href=\"http://lukeslab.info/en/belt-tension-guide\">http://lukeslab.info/en/belt-tension-guide</a>"
	},
	{
	   "title": "College Graduate",
	   "date": "10.02.2024",
	   "content": "I will refrain from being sappy here, but I finished college today and I am pending graduation! This is a massive achievement for me. I have been buried in a computer screen for over 3 months; essentially working two full time jobs all on school. I have never been so proud of myself. Thank you to my loving wife and to those who have supported me along the way."
	}
    ]
}
